Repository: artemnovichkov/wwdc21-samplecode
Catalog: DisplayingHumanFriendlyContent/macOS/*.lproj/Localizable.strings
Languages: ur

source: अंतराल
ur: وقفہ

source: अवधि
ur: دورانیہ

source: काल
ur: دور

source: क्रमसूचक
ur: ترتیبی

source: टेंप्लेट
ur: ٹیمپلیٹ

source: घंटा
ur: گھنٹا

source: तारीख़
ur: تاریخ

source: तारीख़ प्रारूप
ur: تاریخ فارمیٹ

source: तारीख़ व समय
ur: تاریخ و وقت

source: तुलनात्‍मक
ur: تقابلی

source: दिन
ur: دن

source: दी गई इकाई
ur: دیا گیا یونٹ

source: नाम
ur: نام

source: प्रतिशत
ur: فی صد

source: प्राकृतिक पैमाना
ur: قدرتی پیمانہ

source: प्रारूप
ur: فارمیٹ

source: पूर्ण व दशमलव अंक
ur: عددی اور جزوی ہندسے

source: बग़ैर इकाई (सिर्फ़ तापमान पर लागू)
ur: بغیر یونٹ (صرف درجہ حرارت پر لاگو)

source: माप
ur: پیمائش

source: माह
ur: مہینہ

source: मिनट
ur: منٹ

source: मुद्रा
ur: کرنسی

source: मुद्रा – ISO कोड
ur: کرنسی – ISO کوڈ

source: मुद्रा – शाब्दिक
ur: کرنسی – ہجے

source: मुद्रा – हिसाब किताब
ur: کرنسی – حساب کتاب

source: राउंडिंग मोड
ur: راؤنڈنگ موڈ

source: वार
ur: ہفتے کا دن

source: वैज्ञानिक
ur: سائنسی

source: शाब्दिक
ur: ہجے

source: संख्या
ur: نمبر

source: समय
ur: وقت

source: साल
ur: سال

source: सांख्यिक
ur: عددی

source: स्वाभाविक
ur: قدرتی

source: सेकंड
ur: سیکنڈ
