Repository: artemnovichkov/wwdc21-samplecode
Catalog: FrutaBuildingAFeatureRichAppWithSwiftUI/Shared/Resources/*.lproj/Localizable.strings
Languages: ru

source: *Filling* and *refreshing*, this smoothie will fill you with joy!
ru: *Питательный* и *освежающий*, этот смузи — настоящий источник радости!

source: *Get strong* with this delicious spinach smoothie!
ru: *Наберитесь сил* этим с этим восхитительным смузи из шпината!

source: *Packed* with vitamin A and C, Carrot Chops is a great way to start your day!
ru: *Богатая* витаминами A и C, Рубленая морковь — прекрасное начало дня!

source: %@ Ingredient
ru: %@ ингредиент

source: %@ is ready to be picked up.
ru: Смузи «%@» готов!

source: A delicious blend of *tropical fruits and blueberries* will have you sambaing around like you never knew you could!
ru: Великолепный букет *тропических фруктов и ягод* — это настоящая самба вкуса!

source: A refreshing blend that's a *real kick*!
ru: Освежающий смузи доставит *огромное* удовольствие.

source: Add some smoothies to your favorites!
ru: Добавьте несколько смузи в Избранное!

source: Add to Favorites
ru: Добавить в Избранное

source: Berry Blue
ru: Ягодный шок

source: Buy recipe for %@
ru: Купить рецепт за %@

source: Buy with Apple Pay
ru: Купить с Apple Pay

source: Calcium
ru: Кальций

source: Carrot Chops
ru: Рубленная морковь

source: Checked
ru: Отмечено

source: Cholesterol
ru: Холестерин

source: Close
ru: Закрыть

source: Close Nutrition Facts
ru: Закрыть «Пищевую ценность»

source: Complete
ru: Завершено

source: Dance around with this *delicious* tropical blend!
ru: Потанцуйте с этим *изумительным* тропическим смузи!

source: Dietary Fiber
ru: Клетчатка

source: Displays the latest featured smoothie!
ru: Новости из мира смузи

source: Done
ru: Готово

source: Enjoy the *tropical* flavors of coconut and pineapple!
ru: Наслаждайтесь *тропическим* вкусом кокоса и ананаса!

source: Ever wondered what it was like to *drink a peanut butter cup*? Wonder no more!
ru: Когда-нибудь задумывались, каково это *выпить стакан арахисовой пасты*? Пришло время узнать!

source: Favorite
ru: В избранное

source: Favorite Smoothies
ru: Избранные смузи

source: Favorites
ru: Избранное

source: Featured Smoothie
ru: Ассортимент смузи

source: Feel special this summer with the *coolest* drink in our menu!
ru: Этим летом почувствуйте себя особенными с самым *отмороженным* напитком нашего меню!

source: Fruta
ru: Фрута

source: Get the full smoothie experience!
ru: Получите незабываемые впечатления от наших смузи!

source: Hulking Lemonade
ru: Богатырский лимонад

source: If you *love* berries berry berry much, you will love this one!
ru: *Без ума* от ягод? Вам точно полюбится этот смузи!

source: Ingredients: %@.
ru: Состав: %@.

source: Iron
ru: Железо

source: Kiwi Cutie
ru: Милашка киви

source: Kiwi Cutie is beautiful *inside* ***and*** *out*! Packed with nutrients to start your day!
ru: Милашка киви прекрасна, *как ни посмотри*! Заряда витаминов хватит на весь день.

source: Lemonberry
ru: Ягоды с лимоном

source: Loading…
ru: Загрузка…

source: Love You Berry Much
ru: Ягодная любовь

source: Make smoothies at home!
ru: Смузи в домашних условиях

source: Mango Jambo
ru: Манговая феерия

source: Menu
ru: Меню

source: Monounsaturated Fat
ru: Мононенасыщенные жиры

source: Nutrition Facts
ru: Пищевая ценность

source: OK
ru: ОК

source: One in a Melon
ru: Туз‑арбуз

source: Open Nutrition Facts
ru: Открыть «Пищевую ценность»

source: Papa would be proud of you if he saw you drinking this!
ru: Папа будет очень гордиться, если увидит, что Вы пьете этот напиток!

source: Papa's Papaya
ru: Папина папайя

source: Payments Disabled
ru: Платежи отключены

source: Peanut Butter Cup
ru: Стакан арахисовой пасты

source: Piña y Coco
ru: Веселая колада

source: Polyunsaturated Fat
ru: Полиненасыщенные жиры

source: Potassium
ru: Калий

source: Protein
ru: Белок

source: Recipes
ru: Рецепты

source: Redeem Free Smoothie!
ru: Получить бесплатный смузи

source: Remove from Favorites
ru: Удалить из Избранного

source: Rewards
ru: Бонусы

source: Rewards Card
ru: Бонусная карта

source: Sailor Man
ru: Флотский

source: Saturated Fat
ru: Насыщенные жиры

source: See your progress towards your next free smoothie!
ru: Прогресс на пути к бесплатному смузи

source: Select a category
ru: Выберите категорию

source: Select a smoothie
ru: Выберите смузи

source: Serving Size 1 Cup
ru: Содержание в одном стакане

source: Sign up to get rewards!
ru: Зарегистрируйтесь, чтобы получить бонусы!

source: Smoothie
ru: Смузи

source: Smoothie Count
ru: Количество смузи

source: Smoothies
ru: Смузи

source: Sodium
ru: Натрий

source: Stepper
ru: Увеличить или уменьшить количество

source: Sugar
ru: Сахар

source: Thank you for your order!
ru: Спасибо за заказ!

source: That's a Smore!
ru: Райская любовь!

source: That's Berry Bananas!
ru: Море бананов

source: The Fruta QR code was scanned too far from the shop, payments are disabled for your protection.
ru: QR-код Фруты отсканирован слишком далеко от магазина, поэтому в целях Вашей безопасности платежи недоступны.

source: This is not just *any* lemonade. It will give you *powers* you'll struggle to control!
ru: Это *не обыкновенный* лимонад — с ним Вы сможете свернуть горы!

source: Total Carbohydrates
ru: Всего углеводов

source: Total Fat
ru: Всего жиров

source: Tropical Blue
ru: Тропическое индиго

source: Unchecked
ru: Не отмечено

source: Unlock All Recipes
ru: Разблокируйте все рецепты

source: Vitamin A
ru: Витамин A

source: Vitamin C
ru: Витамин C

source: We will notify you when your order is ready.
ru: Вы получите уведомление, когда смузи будет готов.

source: When the world seems to rock like you've had too much choc, that's *a smore*!
ru: С днем рождения поздравит. И, наверно, оставит мне в *пода-а-а-рок* сморов 500!

source: You'll go *crazy* with this classic!
ru: Вы будете *в восторге* от этой классики!

source: Your smoothie is ready!
ru: Ваш смузи готов!
